# PageOrientation Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PrintParameters..::..PageOrientation Property
PrintParameters Class See Also
---
The Page Orientation of the Print Setting.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public PageOrientationType PageOrientation { get; set; }
```

Visual Basic
---
```text
Public Property PageOrientation As PageOrientationType
	Get
	Set
```

Visual C++
---
```text
public:
property PageOrientationType PageOrientation {
	PageOrientationType get ();
	void set (PageOrientationType value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | Thrown when the input argument is out of range. |

# See Also
PrintParameters Class
Autodesk.Revit.DB Namespace